#!/usr/bin/env python3
# -*- coding: utf-8 -*-
#存放游戏所需的全局变量


import os
#profit[1]:房地产每轮的收益率;
#1-4分别是：房地产、新能源、医疗、物流
profit = [[0],[0,-0.1,-0.1,0.05,-0.1,-0.05],[0,0.05,0.05,0.05,0.1,0.05],[0,0,0.05,0.05,-0.05,0.05],[0,0.1,-0.05,0.05,0.05,0.05]]
material_a=[0,1.8,2.2,2.4,1.6,2.1]  #a原料每轮的价格
material_b=[0,1,1,1,1,1]  #b原料每轮的价格
# bot_price=[0,9,10,8,11,11] #机器人每轮的系统回收价

#固定数据
#每轮的市场容量
capacity=[
          [[0,0,0,0,0,0], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [0,0,0,0,0,0]],
          [[0,0,0,0,0,0], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [0,0,0,0,0,0]],
          [[0,0,0,0,0,0], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [[10,40],[20,20],[50,8],[100,4],[200,2],[500,0.8],[1000,0.4]], [0,0,0,0,0,0]]
         ]

store_fee = 5

#碳纤维占用库存
chip_space=2
#无人机占用库存
product_space=2

#A,B公司的加工费（轮*生产单位）
processfee_a = 3  
processfee_b = 3
reduced_fee = 2
#折旧费（轮）
depreciation_material_a=0.1  #A原料折旧费
depreciation_material_b=0.3  #B原料折旧费
depreciation_a = 0.3 #碳纤维折旧费
depreciation_b = 0.9 #无人机折旧费
#A,B公司的仓储费（轮）  
# storage_a = 30 #500平米
# storage_b = 50 #800 平米
storage_cost=30 
# storage_chip = 0.04

#变卖时回收价
chip_price = 3
product_price=7
resource_price_a = 1.5
resource_price_b = 0.5

#功能卡仓库增加
add_store=200	#仓库增量
cost_store=15	#每轮租赁费增量

#游戏总共进行5轮
end_round = 5

#梯度回收最高成交价
max_price=0

dir = os.path.dirname(os.path.abspath(__file__))
path = os.path.join(dir,"data")+os.path.sep
f=open(path+"game.txt","r")  #duqu game
game_round= int(f.read())
print("read gl")
f.close()